PeterVranken/DEVKIT-MPC5748G-flashBootLoader/FBL/code/system/drivers/flashROM/eap_eraseAndProgram.c
/**
 * @file eap_eraseAndProgram.c
 * Erase and program operations for the C55FMC.
 *
 * Copyright (C) 2026 Peter Vranken (mailto:Peter_Vranken@Yahoo.de)
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU Lesser General Public License as published by the
 * Free Software Foundation, either version 3 of the License, or any later
 * version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License
 * for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 */
/* Module interface
 *   eap_osInitFlashRomDriver
 *   eap_osStartEraseFlashBlocks
 *   eap_osGetStatusEraseFlashBlocks
 *   eap_osStartProgramQuadPage
 *   eap_osGetStatusProgramQuadPage
 *   eap_abortEraseAndProgram
 * Local functions
 *   disableAllFlashBlocks
 *   enableFlashBlocks
 *   isQuadPageBlank
 *   verifyQuadPage
 */

/*
 * Include files
 */

#include "eap_eraseAndProgram.h"

#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>
#include <stdio.h>
#include <assert.h>

#include "rom_flashRom.h"

/* Include the appropriate MCU header. */
#if defined(MCU_MPC5748G)
# include "MPC5748G.h"
#elif defined(MCU_MPC5775B)
# include "MPC5775B.h"
#elif defined(MCU_MPC5775E)
# include "MPC5775E.h"
#elif defined(MCU_MPC5777C)
# include "MPC5777C.h"
#else
# error Unsupported MCU configured
#endif

/*
 * Defines
 */


/*
 * Local type definitions
 */

/** The description of a flash block. */
typedef struct 
{
    /** Address of first byte of flash block. */
    uint32_t addrFrom;
    
    /** Address of first byte (exclusive) of flash block. */
    uint32_t addrTo;
    
    /** The index of the RWW partition. */
    uint8_t idxPartition;
    
    /** The index of the lock or select register, which controls the block. */
    uint8_t idxLockReg;
    
    /** A bit mask with a single bit set. The bit masks the control bit for the given flash
        block in the related lock or select register \a idxLockReg. */
    uint32_t bitMaskLockReg;
    
} flashBlockDesc_t;

/*
 * Local prototypes
 */


/*
 * Data definitions
 */

static const flashBlockDesc_t RODATA(flashBlockDescAry)[] =
{
#if defined(MCU_MPC5748G)
    {.addrFrom = 0x00FC0000u, .addrTo = 0x00FC8000u, .idxPartition = 0u, .idxLockReg = 0u, .bitMaskLockReg = 0x00040000u,},  /* 32KB Code Flash block */
    {.addrFrom = 0x00FC8000u, .addrTo = 0x00FD0000u, .idxPartition = 0u, .idxLockReg = 0u, .bitMaskLockReg = 0x00080000u,},  /* 32KB Code Flash block */
    {.addrFrom = 0x00FD0000u, .addrTo = 0x00FD8000u, .idxPartition = 1u, .idxLockReg = 0u, .bitMaskLockReg = 0x00100000u,},  /* 32KB Code Flash block */
    {.addrFrom = 0x00FD8000u, .addrTo = 0x00FE0000u, .idxPartition = 1u, .idxLockReg = 0u, .bitMaskLockReg = 0x00200000u,},  /* 32KB Code Flash block */
    {.addrFrom = 0x00FE0000u, .addrTo = 0x00FF0000u, .idxPartition = 0u, .idxLockReg = 0u, .bitMaskLockReg = 0x00400000u,},  /* 64KB Code Flash block */
    {.addrFrom = 0x00FF0000u, .addrTo = 0x01000000u, .idxPartition = 1u, .idxLockReg = 0u, .bitMaskLockReg = 0x01000000u,},  /* 64KB Code Flash block */
    {.addrFrom = 0x01000000u, .addrTo = 0x01040000u, .idxPartition = 6u, .idxLockReg = 2u, .bitMaskLockReg = 0x00000001u,},  /* 256KB Code Flash block */
    {.addrFrom = 0x01040000u, .addrTo = 0x01080000u, .idxPartition = 6u, .idxLockReg = 2u, .bitMaskLockReg = 0x00000002u,},  /* 256KB Code Flash block */
    {.addrFrom = 0x01080000u, .addrTo = 0x010C0000u, .idxPartition = 6u, .idxLockReg = 2u, .bitMaskLockReg = 0x00000004u,},  /* 256KB Code Flash block */
    {.addrFrom = 0x010C0000u, .addrTo = 0x01100000u, .idxPartition = 6u, .idxLockReg = 2u, .bitMaskLockReg = 0x00000008u,},  /* 256KB Code Flash block */
    {.addrFrom = 0x01100000u, .addrTo = 0x01140000u, .idxPartition = 6u, .idxLockReg = 2u, .bitMaskLockReg = 0x00000010u,},  /* 256KB Code Flash block */
    {.addrFrom = 0x01140000u, .addrTo = 0x01180000u, .idxPartition = 6u, .idxLockReg = 2u, .bitMaskLockReg = 0x00000020u,},  /* 256KB Code Flash block */
    {.addrFrom = 0x01180000u, .addrTo = 0x011C0000u, .idxPartition = 6u, .idxLockReg = 2u, .bitMaskLockReg = 0x00000040u,},  /* 256KB Code Flash block */
    {.addrFrom = 0x011C0000u, .addrTo = 0x01200000u, .idxPartition = 6u, .idxLockReg = 2u, .bitMaskLockReg = 0x00000080u,},  /* 256KB Code Flash block */
    {.addrFrom = 0x01200000u, .addrTo = 0x01240000u, .idxPartition = 7u, .idxLockReg = 2u, .bitMaskLockReg = 0x00000100u,},  /* 256KB Code Flash block */
    {.addrFrom = 0x01240000u, .addrTo = 0x01280000u, .idxPartition = 7u, .idxLockReg = 2u, .bitMaskLockReg = 0x00000200u,},  /* 256KB Code Flash block */
    {.addrFrom = 0x01280000u, .addrTo = 0x012C0000u, .idxPartition = 7u, .idxLockReg = 2u, .bitMaskLockReg = 0x00000400u,},  /* 256KB Code Flash block */
    {.addrFrom = 0x012C0000u, .addrTo = 0x01300000u, .idxPartition = 7u, .idxLockReg = 2u, .bitMaskLockReg = 0x00000800u,},  /* 256KB Code Flash block */
    {.addrFrom = 0x01300000u, .addrTo = 0x01340000u, .idxPartition = 7u, .idxLockReg = 2u, .bitMaskLockReg = 0x00001000u,},  /* 256KB Code Flash block */
    {.addrFrom = 0x01340000u, .addrTo = 0x01380000u, .idxPartition = 7u, .idxLockReg = 2u, .bitMaskLockReg = 0x00002000u,},  /* 256KB Code Flash block */
    {.addrFrom = 0x01380000u, .addrTo = 0x013C0000u, .idxPartition = 7u, .idxLockReg = 2u, .bitMaskLockReg = 0x00004000u,},  /* 256KB Code Flash block */
    {.addrFrom = 0x013C0000u, .addrTo = 0x01400000u, .idxPartition = 7u, .idxLockReg = 2u, .bitMaskLockReg = 0x00008000u,},  /* 256KB Code Flash block */
    {.addrFrom = 0x01400000u, .addrTo = 0x01440000u, .idxPartition = 8u, .idxLockReg = 2u, .bitMaskLockReg = 0x00010000u,},  /* 256KB Code Flash block */
    {.addrFrom = 0x01440000u, .addrTo = 0x01480000u, .idxPartition = 8u, .idxLockReg = 2u, .bitMaskLockReg = 0x00020000u,},  /* 256KB Code Flash block */
    {.addrFrom = 0x01480000u, .addrTo = 0x014C0000u, .idxPartition = 8u, .idxLockReg = 2u, .bitMaskLockReg = 0x00040000u,},  /* 256KB Code Flash block */
    {.addrFrom = 0x014C0000u, .addrTo = 0x01500000u, .idxPartition = 9u, .idxLockReg = 2u, .bitMaskLockReg = 0x00080000u,},  /* 256KB Code Flash block */
    {.addrFrom = 0x01500000u, .addrTo = 0x01540000u, .idxPartition = 9u, .idxLockReg = 2u, .bitMaskLockReg = 0x00100000u,},  /* 256KB Code Flash block */
    {.addrFrom = 0x01540000u, .addrTo = 0x01580000u, .idxPartition = 9u, .idxLockReg = 2u, .bitMaskLockReg = 0x00200000u,},  /* 256KB Code Flash block */
#elif defined(MCU_MPC5775B) || defined(MCU_MPC5775E)
# error Specify flash block configuration for MPC5775B/E
#elif defined(MCU_MPC5777C)
# error Specify flash block configuration for MPC5777C
#endif
};

