PeterVranken/DEVKIT-MPC5748G-flashBootLoader/FBL/code/system/drivers/flashROM/eap_eraseAndProgram.c
/** Temporary storage of the quad-page buffer, which is currently being programmed. The
    buffer is stored at the start of progamming for verification when program mode is left. */
static const eap_quadPageProgramBuffer_t *BSS_OS(_pPrgDataBuf) = NULL;

/*
 * Function implementation
 */

/**
 * Helper: All flash blocks are (initially) protected against erasure and programming;
 * over-programming is disabled, too.
 */
static void disableAllFlashBlocks(void)
{
#if defined(MCU_MPC5748G)
# define LOCK_ALL_BLKS_0    0xBFFFFFFFu
# define LOCK_ALL_BLKS_1    0xFFFFFFFFu
# define LOCK_ALL_BLKS_2    0xFFFFFFFFu
# define LOCK_ALL_BLKS_3    0xFFFFFFFFu
# define SELECT_NO_BLK_0    0x00000000u
# define SELECT_NO_BLK_1    0x00000000u
# define SELECT_NO_BLK_2    0x00000000u
# define SELECT_NO_BLK_3    0x00000000u
#elif defined(MCU_MPC5775B) || defined(MCU_MPC5775E)
# error Specify flash block configuration for MPC5775B/E
#elif defined(MCU_MPC5777C)
# error Specify flash block configuration for MPC5777C
#endif

    /* Lock all blocks against erasure and programming. RM 74.1.1.1ff, pp.3639ff. */
    C55FMC->LOCK0 = LOCK_ALL_BLKS_0;
    C55FMC->LOCK1 = LOCK_ALL_BLKS_1;
    C55FMC->LOCK2 = LOCK_ALL_BLKS_2;
    C55FMC->LOCK3 = LOCK_ALL_BLKS_3;

    /* Unselect all blocks from erasure. Dito. */
    C55FMC->SEL0 = SELECT_NO_BLK_0;
    C55FMC->SEL1 = SELECT_NO_BLK_1;
    C55FMC->SEL2 = SELECT_NO_BLK_2;
    C55FMC->SEL3 = SELECT_NO_BLK_3;

} /* disableAllFlashBlocks */


/**
 * Enable those flash blocks, which are required for an intended erase or program activity.
 *   @param[in] addressFrom
 * The required blocks are specified by the address range, which is affected by the
 * intended activity. All flash blocks, which share at least one byte with the specified
 * address range, will be enabled, all others don't. This is the first address of the
 * range.\n
 *   Note, addressFrom and \a noBytes need to from a valid, supported address range in the
 * flashable area. This can be checked beforehand using rom_isValidFlashAddressRange().
 *   @param[in] noBytes
 * This is the length in Byte of the address range.\n
 *   Note, if the intended activity is programming, then this value needs to be
 * #EAP_C55FMC_SIZE_OF_QUAD_PAGE, the size of a single programmed (quad-)page.
 *   @param[in] isErase
 * A Boolean flag selects the intended activity. Pass \a true if the blocks are enabled for
 * erasure and \a false if they are enabled for programming.
 */
static void enableFlashBlocks(uint32_t addressFrom, uint32_t noBytes, bool isErase)
{
    const uint32_t addressTo = addressFrom + noBytes;
    
    /* We address to the lock and select registers as an array. */
    _Static_assert
        ( (uintptr_t)&C55FMC->LOCK1 == (uintptr_t)&C55FMC->LOCK0 + 1*sizeof(C55FMC->LOCK0)
          &&  (uintptr_t)&C55FMC->LOCK2 == (uintptr_t)&C55FMC->LOCK0 + 2*sizeof(C55FMC->LOCK0)
          &&  (uintptr_t)&C55FMC->LOCK3 == (uintptr_t)&C55FMC->LOCK0 + 3*sizeof(C55FMC->LOCK0)
          &&  (uintptr_t)&C55FMC->SEL1 == (uintptr_t)&C55FMC->SEL0 + 1*sizeof(C55FMC->SEL0)
          &&  (uintptr_t)&C55FMC->SEL2 == (uintptr_t)&C55FMC->SEL0 + 2*sizeof(C55FMC->SEL0)
          &&  (uintptr_t)&C55FMC->SEL3 == (uintptr_t)&C55FMC->SEL0 + 3*sizeof(C55FMC->SEL0)
        , "Addressing of registers as an array fails"
        );

    /* We always program single quad-pages. */
    assert(isErase ||  noBytes == EAP_C55FMC_SIZE_OF_QUAD_PAGE);
    
    /* If we see an overflow then we definitly have an invalid address space. (ROM at the
       very end of the address space is not supported by the implementation.) A valid adress
       ranges is a prerequiste of calling this function. */
    assert(addressTo >= addressFrom);

    /* We check for each flash block if it is touched and needs to be enabled. We don't do
       the opposite; we don't check if all enabled flash blocks really cover the complete
       desired address range. If the address range is valid, should be checked beforehand.
         The search loop is optimize for the frequent calls of this function in programming
       mode: We inspect the last recently enabled block first. */
    _Static_assert(sizeOfAry(flashBlockDescAry) <= 256u, "Overflow of uint8_t idxBlk_");
    static uint8_t SBSS_OS(idxBlk_) = 0u;
    for(unsigned int u=0u; u<sizeOfAry(flashBlockDescAry); ++u, ++idxBlk_)
    {
        if(idxBlk_ >= sizeOfAry(flashBlockDescAry))
            idxBlk_ = 0u;
            
        const flashBlockDesc_t * const pBlkDesc = &flashBlockDescAry[idxBlk_];
        if(pBlkDesc->addrFrom < addressTo  &&  pBlkDesc->addrTo > addressFrom)
        {
            /* This flash block needs to be unlocked. */
            volatile uint32_t * const lockRegAry = &C55FMC->LOCK0;
            assert((lockRegAry[pBlkDesc->idxLockReg] & pBlkDesc->bitMaskLockReg) != 0u);
            lockRegAry[pBlkDesc->idxLockReg] &= ~pBlkDesc->bitMaskLockReg;
            
            /* Erased blocks need to be explicitly selected. */
            if(isErase)
            {
                volatile uint32_t * const selectRegAry = &C55FMC->SEL0;
                assert((selectRegAry[pBlkDesc->idxLockReg] & pBlkDesc->bitMaskLockReg) == 0u);
                selectRegAry[pBlkDesc->idxLockReg] |= pBlkDesc->bitMaskLockReg;
                #if 1
                iprintf( "Select flash block %06lX..%06lX for erasure.\r\n"
                       , pBlkDesc->addrFrom
                       , pBlkDesc->addrTo
                       );
                #endif
            }
            else
            {
                /* We always program single quad-pages, so there can't be more than one
                   touched flash block. */
                #if 1
                iprintf( "Unlock flash block %06lX..%06lX for programming.\r\n"
                       , pBlkDesc->addrFrom
                       , pBlkDesc->addrTo
                       );
                #endif
                break;
            }
        }
    } /* for(All configured flash blocks.) */

} /* enableFlashBlocks */


/**
 * Check if a quad-page is blank.
 */
static inline bool isQuadPageBlank(uint32_t addrOfQuadPage)
{
    assert(EAP_GET_ADDR_OFFS_IN_QUAD_PAGE(addrOfQuadPage) == 0u);
    _Static_assert( EAP_C55FMC_SIZE_OF_QUAD_PAGE / sizeof(uint64_t) == 16u
                    &&  EAP_C55FMC_SIZE_OF_QUAD_PAGE % sizeof(uint64_t) == 0u
                  , "Bad implementation of blank check"
                  );
    const volatile uint64_t *pRd = (const volatile uint64_t*)addrOfQuadPage;
#if 0
    const unsigned int noDWords = EAP_C55FMC_SIZE_OF_QUAD_PAGE/sizeof(uint64_t);
    for(unsigned int idxDWd=0u; idxDWd<noDWords; ++idxDWd, ++pRd)
        if(*pRd != 0xFFFFFFFFFFFFFFFFull)
            return false;
#else
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
    if(*pRd++ != 0xFFFFFFFFFFFFFFFFull) return false;
#endif

    assert((uint32_t)pRd == addrOfQuadPage + EAP_C55FMC_SIZE_OF_QUAD_PAGE);
    return true;
    
} /* isQuadPageBlank */


/**
 * Check if the falsh ROM contents of a quad-page are identical to some expected data.
 *   @return
 * Get \a true if the flash ROM contains the data in \a pPrgDataBuf->data_b. Get \a
 * false in case of any deviation.
 *   @param[in] pPrgDataBuf
 * A data buffer by reference, which conatins the expected contents of a quad-page.
 */
static bool verifyQuadPage(const eap_quadPageProgramBuffer_t * const pPrgDataBuf)
{
    assert( pPrgDataBuf != NULL 
            &&  EAP_GET_ADDR_OFFS_IN_QUAD_PAGE(pPrgDataBuf->address) == 0u
          );
    _Static_assert( EAP_C55FMC_SIZE_OF_QUAD_PAGE / sizeof(uint64_t) == 16u
                    &&  EAP_C55FMC_SIZE_OF_QUAD_PAGE % sizeof(uint64_t) == 0u
                  , "Bad implementation of verify"
                  );
    const volatile uint64_t *pFlash = (const volatile uint64_t*)pPrgDataBuf->address;
    const uint64_t *pExptd = &pPrgDataBuf->data_u64[0];
     
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;
    if(*pFlash++ != *pExptd++) return false;

    assert((uint32_t)pFlash == (uint32_t)pPrgDataBuf->address + EAP_C55FMC_SIZE_OF_QUAD_PAGE);
    return true;

