PeterVranken/DEVKIT-MPC5748G-flashBootLoader/FBL/code/system/drivers/flashROM/eap_eraseAndProgram.c
    return retCode;
    
} /* eap_osGetStatusEraseFlashBlocks */


/**
 * Start the programming of a single quad-page in the C55 controller.\n
 *   The preconditions are checked (availability of controller for new write-page
 * operation), the write buffer is filled with the data and high voltage is enabled, which
 * makes the flash programming begin. The function is non-blocking and doesn't wait for the
 * termination of the program step. Use eap_osGetStatusProgramQuadPage() to find out, when
 * it has terminated.
 *   @return
 * Get the status: If everything succeeded, then it is pending (#rom_err_processPending),
 * otherwise an error message.
 *   @param[in] pPrgDataBuf
 * The buffer with the data to program and the target address in flash ROM.\n
 *   Caution: The buffer needs to be unmodified and available to the flash ROM driver until
 * programming of the quad-page has completed - either until
 * eap_osGetStatusProgramQuadPage() has reported the end of the operation (no matter
 * whether successful) or until the programming mode has been aborted using
 * eap_abortEraseAndProgram().
 */
rom_errorCode_t eap_osStartProgramQuadPage(eap_quadPageProgramBuffer_t * const pPrgDataBuf)
{
    rom_errorCode_t retCode;
    const uint32_t mcr = C55FMC->MCR;
    
    if( EAP_GET_ADDR_OFFS_IN_QUAD_PAGE(pPrgDataBuf->address) != 0u
        || !rom_isValidFlashAddressRange(pPrgDataBuf->address, EAP_C55FMC_SIZE_OF_QUAD_PAGE)
      )
    {
        retCode = rom_err_badAddressRange;      
    }
    
    /* To initiate programming, no other operation must be in progress. */
    #define BITS_TO_BE_CLEARED  (C55FMC_MCR_ERS_MASK     \
                                 |C55FMC_MCR_PGM_MASK    \
                                 |C55FMC_MCR_EHV_MASK    \
                                 |C55FMC_MCR_PSUS_MASK   \
                                 |C55FMC_MCR_ESUS_MASK   \
                                )
    else if((mcr & BITS_TO_BE_CLEARED) == 0u)
    #undef BITS_TO_BE_CLEARED
    {
// TODO Blank test fails although programming will yield correct result and debugger shows
// erased memory after entering a new session. Do we have a cache inconsistency issue here?
        //if(!isQuadPageBlank(pPrgDataBuf->address))
        //    retCode = rom_err_quadPageNotBlank;      
        //else
        {
            /* Enable the flash block for programming, which the wanted quad-page sits in. */
            enableFlashBlocks( pPrgDataBuf->address
                             , EAP_C55FMC_SIZE_OF_QUAD_PAGE
                             , /*isErase*/ false
                             );

            /* Set MCR[PGM] to start program operation. */
            C55FMC->MCR |= C55FMC_MCR_PGM_MASK;

            /* We always write an entire quad-page at once. */

            /* Copy quad-page contents into the controller's data buffer. This is at the
               same time the required interlock write. */
            const uint32_t *pRd = &pPrgDataBuf->data_u32[0];
            volatile uint32_t *pWr = (volatile uint32_t*)pPrgDataBuf->address;

            _Static_assert(EAP_C55FMC_SIZE_OF_QUAD_PAGE % 4u == 0u, "Bad configuration");
            for(unsigned int u=0u; u<EAP_C55FMC_SIZE_OF_QUAD_PAGE/4u; ++u)
                * pWr++ = * pRd++;

            /* After filling the write buffer, we set MCR[EHV] to turn on the high voltage
               for flashing. See RM48, 74.5.1, p.3656. */
            C55FMC->MCR |= C55FMC_MCR_EHV_MASK;

            /* Save the reference to the input data buffer; we still need it at the end for a
               verify. */
            _pPrgDataBuf = pPrgDataBuf;

            /* This is a non-blocking function. We don't wait for the result but will check
               it in the next clock tick. */
            retCode = rom_err_processPending;

        } /* if(Quad-page is erased?) */
    }
    else
    {
        /* Turn off high voltage, reset all operation request bits and lock flash blocks. */
        eap_abortEraseAndProgram();

        retCode = rom_err_unexpectedHwState;
    }

    return retCode;

} /* eap_osStartProgramQuadPage */


/**
 * Check the status of a programming operation, which had been initiated before by
 * eap_osStartProgramQuadPage().
 *   @return
 * Get the status of the operation. eap_osStartEraseFlashBlocks() or
 * eap_osStartProgramQuadPage() can be called earliest again when this function returns
 * either success or failure - but not yet while it reports a pending state
 * (#rom_err_processPending).
 */
rom_errorCode_t eap_osGetStatusProgramQuadPage(void)
{
    rom_errorCode_t retCode;

    /* There must be a program operation but no suspend or erase visible. */
    const uint32_t mcr = C55FMC->MCR;
    #define BITS_TO_BE_SET      (C55FMC_MCR_PGM_MASK|C55FMC_MCR_EHV_MASK)
    #define BITS_TO_BE_CLEARED  (C55FMC_MCR_ERS_MASK|C55FMC_MCR_PSUS_MASK|C55FMC_MCR_ESUS_MASK)
    if((mcr & BITS_TO_BE_SET) == BITS_TO_BE_SET  &&  (mcr & BITS_TO_BE_CLEARED) == 0u)
    #undef BITS_TO_BE_SET
    #undef BITS_TO_BE_CLEARED
    {
        /* Check MCR[DONE]. 1 means operation done. */
        if((mcr & C55FMC_MCR_DONE_MASK) != 0u)
        {
            /* Check MCR[PEG]. A zero bit indicates a programming error. */
            if((mcr & C55FMC_MCR_PEG_MASK) != 0u)
                retCode = rom_err_noError;
            else
                retCode = rom_err_c55FmcErrorInPeg;
        }
        else
        {
            /* MCR[DONE]=0: The operation is still in progress. We wait till next clock
               tick for the next check. */
            retCode = rom_err_processPending;
        }
    }
    else
        retCode = rom_err_unexpectedHwState;

    if(retCode != rom_err_processPending)
    {
        /* Turn off high voltage, reset all operation request bits and lock flash blocks. */
        eap_abortEraseAndProgram();
        
        /* After terminating high voltage and programming mode, the data from the partition
           is again readable and we can verify the programming result. */
        if(retCode == rom_err_noError  && !verifyQuadPage(_pPrgDataBuf))
            retCode = rom_err_verifyFailed;
    }



